#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.pubsub_repo_amazonsqs.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/amazonsqs/"
        id                          = "watermill-amazonsqs"
        name                        = "watermill-amazonsqs"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_amazonsqs.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill Amazon SQS/SNS Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-amazonsqs/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-amazonsqs/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-amazonsqs)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-amazonsqs)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            It uses the [Amazon SQS](https://aws.amazon.com/sqs/) and [Amazon SNS](https://aws.amazon.com/sns/) services.
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-amazonsqs"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_amqp.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/amqp/"
        id                          = "watermill-amqp"
        name                        = "watermill-amqp"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_amqp.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill AMQP Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-amqp/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-amqp/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-amqp)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-amqp)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-amqp"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_bolt.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/bolt/"
        id                          = "watermill-bolt"
        name                        = "watermill-bolt"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_bolt.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill Bolt Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-bolt/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-bolt/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-bolt)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-bolt)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            It uses the [Bolt](https://github.com/etcd-io/bbolt) database.
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-bolt"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_firestore.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/firestore/"
        id                          = "watermill-firestore"
        name                        = "watermill-firestore"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_firestore.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill Firestore Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-firestore/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-firestore/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-firestore)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-firestore)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            It uses the [Firestore](https://firebase.google.com/docs/firestore) database.
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-firestore"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_googlecloud.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/googlecloud/"
        id                          = "watermill-googlecloud"
        name                        = "watermill-googlecloud"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_googlecloud.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill Google Cloud Pub/Sub Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-googlecloud/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-googlecloud/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-googlecloud)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-googlecloud)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            It uses the [Google Cloud Pub/Sub](https://cloud.google.com/pubsub) service.
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-googlecloud"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_http.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/http/"
        id                          = "watermill-http"
        name                        = "watermill-http"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_http.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill HTTP Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-http/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-http/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-http)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-http)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-http"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_io.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/io/"
        id                          = "watermill-io"
        name                        = "watermill-io"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_io.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill IO Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-io/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-io/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-io)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-io)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-io"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_kafka.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/kafka/"
        id                          = "watermill-kafka"
        name                        = "watermill-kafka"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_kafka.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill Kafka Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-kafka/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-kafka/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-kafka)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-kafka)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-kafka"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_nats.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/nats/"
        id                          = "watermill-nats"
        name                        = "watermill-nats"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_nats.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill NATS Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-nats/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-nats/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-nats)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-nats)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            It targets NATS - primarily streaming use cases via [JetStream](https://docs.nats.io/nats-concepts/jetstream).
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-nats"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_redisstream.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/redisstream/"
        id                          = "watermill-redisstream"
        name                        = "watermill-redisstream"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_redisstream.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "main"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill Redis Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-redisstream/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-redisstream/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-redisstream)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-redisstream)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-redisstream"
      + sha                 = (known after apply)
    }

  # module.pubsub_repo_sql.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      + homepage_url                = "https://watermill.io/pubsubs/sql/"
        id                          = "watermill-sql"
        name                        = "watermill-sql"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pubsub_repo_sql.github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + branch              = "master"
      + commit_message      = "Update README.md (by Terraform)"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # Watermill SQL (Postgres/MySQL) Pub/Sub
            <img align="right" width="200" src="https://threedots.tech/watermill-io/watermill-logo.png">
            
            [![CI Status](https://github.com/ThreeDotsLabs/watermill-sql/actions/workflows/master.yml/badge.svg)](https://github.com/ThreeDotsLabs/watermill-sql/actions/workflows/master.yml)
            [![Go Report Card](https://goreportcard.com/badge/github.com/ThreeDotsLabs/watermill-sql)](https://goreportcard.com/report/github.com/ThreeDotsLabs/watermill-sql)
            
            This is Pub/Sub for the [Watermill](https://watermill.io/) project.
            
            
            See [DEVELOPMENT.md](./DEVELOPMENT.md) for more information about running and testing.
            
            Watermill is a Go library for working efficiently with message streams. It is intended
            for building event driven applications, enabling event sourcing, RPC over messages,
            sagas and basically whatever else comes to your mind. You can use conventional pub/sub
            implementations like Kafka or RabbitMQ, but also HTTP or MySQL binlog if that fits your use case.
            
            All Pub/Sub implementations can be found at [https://watermill.io/pubsubs/](https://watermill.io/pubsubs/).
            
            Documentation: https://watermill.io/
            
            Getting started guide: https://watermill.io/docs/getting-started/
            
            Issues: https://github.com/ThreeDotsLabs/watermill/issues
            
            ## Contributing
            
            All contributions are very much welcome. If you'd like to help with Watermill development,
            please see [open issues](https://github.com/ThreeDotsLabs/watermill/issues?utf8=%E2%9C%93&q=is%3Aissue+is%3Aopen+)
            and submit your pull request via GitHub.
            
            ## Support
            
            If you didn't find the answer to your question in [the documentation](https://watermill.io/), feel free to ask us directly!
            
            Please join us on the `#watermill` channel on the [Three Dots Labs Discord](https://discord.gg/QV6VFg4YQE).
            
            ## License
            
            [MIT License](./LICENSE)
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "watermill-sql"
      + sha                 = (known after apply)
    }

Plan: 11 to add, 11 to change, 0 to destroy.


```

</details>

*Pushed by @m110*